OpenROAD 26Q1-1788-gdc4da4fafa 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 10 thread(s).
read_liberty /OpenROAD-flow-scripts/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib
[INFO ODB-0227] LEF file: /OpenROAD-flow-scripts/flow/platforms/nangate45/lef/NangateOpenCellLibrary.tech.lef, created 22 layers, 27 vias
[INFO ODB-0227] LEF file: /OpenROAD-flow-scripts/flow/platforms/nangate45/lef/NangateOpenCellLibrary.macro.mod.lef, created 135 library cells
link_design prob155_perf_top
source /OpenROAD-flow-scripts/flow/platforms/nangate45/setRC.tcl
write_db ./results/nangate45/prob155_perf_top/base/1_synth.odb
write_sdc -no_timestamp ./results/nangate45/prob155_perf_top/base/1_synth.sdc
Elapsed time: 0:00.55[h:]min:sec. CPU time: user 0.52 sys 0.01 (98%). Peak memory: 129868KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
1_synth                            0            126 8f735b192b270a111388
