OpenROAD 26Q1-1788-gdc4da4fafa 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 10 thread(s).
read_liberty /OpenROAD-flow-scripts/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib
read_db ./results/nangate45/prob155_perf_top/base/2_1_floorplan.odb
source /OpenROAD-flow-scripts/flow/platforms/nangate45/setRC.tcl
No macros found: Skipping macro_placement
write_db ./results/nangate45/prob155_perf_top/base/2_2_floorplan_macro.odb
Elapsed time: 0:00.53[h:]min:sec. CPU time: user 0.51 sys 0.01 (98%). Peak memory: 128172KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_2_floorplan_macro                0            125 2d57b5289371a1dc12fa
