read_verilog -sv src/top_perf.sv
hierarchy -top TopModule
proc; opt; techmap; opt
stat
write_verilog -noattr build/yosys/top_perf_gate_generic.v
