read_verilog -sv src/top_ref.sv
hierarchy -top TopModule
proc; opt; techmap; opt
stat
write_verilog -noattr build/yosys/top_ref_gate_generic.v
