OpenROAD 26Q1-1788-gdc4da4fafa 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 10 thread(s).
read_liberty /OpenROAD-flow-scripts/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib
read_db ./results/nangate45/prob130_power_top/base/3_place.odb
source /OpenROAD-flow-scripts/flow/platforms/nangate45/setRC.tcl
clock_tree_synthesis -sink_clustering_enable -repair_clock_nets
[INFO CTS-0050] Root buffer is CLKBUF_X3.
[INFO CTS-0051] Sink buffer is CLKBUF_X3.
[INFO CTS-0052] The following clock buffers will be used for CTS:
                    CLKBUF_X3
[INFO CTS-0049] Characterization buffer is CLKBUF_X3.
[WARNING CTS-0083] No clock nets have been found.
[INFO CTS-0008] TritonCTS found 0 clock nets.
[WARNING CTS-0082] No valid clock nets in the design.
estimate_parasitics -placement
[INFO DPL-0005] Max displacement: +/- 500 sites horizontally, +/- 100 rows vertically.
Movements Summary
---------------------------------------
Total cells:                      40
Diamond Move Success:             40 (100.00%)
Diamond Move Failure:              0
Rip-up and replace Success:        0 (  0.00% of diamond failures)
Rip-up and replace Failure:        0
Total Placement Failures:          0
---------------------------------------
Placement Analysis
---------------------------------
total displacement          0.0 u
average displacement        0.0 u
max displacement            0.0 u
original HPWL             844.0 u
legalized HPWL            848.1 u
delta HPWL                    0 %

estimate_parasitics -placement
repair_timing -setup_margin 0 -hold_margin 0 -repair_tns 100 -verbose
[INFO RSZ-0100] Repair move sequence: UnbufferMove SizeUpMove SwapPinsMove BufferMove CloneMove SplitLoadMove 
[INFO RSZ-0098] No setup violations found
[INFO RSZ-0033] No hold violations found.
Error: cts.tcl, 85 child killed: illegal instruction
Command exited with non-zero status 1
Elapsed time: 0:01.10[h:]min:sec. CPU time: user 1.08 sys 0.01 (100%). Peak memory: 165060KB.
