read_verilog -sv prob080_timer/src/top_perf.sv
hierarchy -top TopModule
proc; opt; techmap; opt
abc -g AND,OR,XOR,XNOR,INV
opt
stat
write_verilog -noattr prob080_timer/build/yosys_top_perf_gate_abc.v
