read_verilog -sv prob080_timer/src/top_area.sv
hierarchy -top TopModule
proc; opt; techmap; opt
stat
write_verilog -noattr prob080_timer/build/yosys_top_area_gate_generic.v
