read_verilog -sv src/top_power.sv
hierarchy -top TopModule
proc; opt; techmap; opt
stat
write_verilog -noattr build/yosys/top_power_gate_generic.v
