###############################################################################
# Created by write_sdc
###############################################################################
current_design prob105_perf_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 10.0000 [get_ports {clk}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[0]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[10]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[11]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[12]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[13]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[14]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[15]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[16]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[17]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[18]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[19]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[1]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[20]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[21]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[22]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[23]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[24]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[25]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[26]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[27]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[28]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[29]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[2]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[30]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[31]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[32]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[33]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[34]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[35]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[36]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[37]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[38]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[39]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[3]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[40]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[41]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[42]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[43]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[44]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[45]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[46]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[47]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[48]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[49]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[4]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[50]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[51]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[52]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[53]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[54]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[55]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[56]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[57]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[58]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[59]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[5]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[60]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[61]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[62]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[63]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[64]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[65]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[66]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[67]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[68]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[69]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[6]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[70]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[71]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[72]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[73]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[74]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[75]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[76]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[77]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[78]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[79]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[7]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[80]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[81]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[82]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[83]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[84]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[85]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[86]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[87]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[88]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[89]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[8]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[90]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[91]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[92]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[93]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[94]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[95]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[96]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[97]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[98]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[99]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {data[9]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ena[0]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {ena[1]}]
set_input_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {load}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[0]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[10]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[11]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[12]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[13]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[14]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[15]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[16]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[17]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[18]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[19]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[1]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[20]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[21]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[22]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[23]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[24]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[25]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[26]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[27]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[28]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[29]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[2]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[30]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[31]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[32]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[33]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[34]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[35]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[36]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[37]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[38]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[39]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[3]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[40]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[41]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[42]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[43]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[44]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[45]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[46]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[47]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[48]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[49]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[4]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[50]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[51]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[52]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[53]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[54]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[55]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[56]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[57]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[58]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[59]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[5]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[60]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[61]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[62]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[63]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[64]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[65]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[66]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[67]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[68]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[69]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[6]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[70]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[71]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[72]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[73]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[74]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[75]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[76]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[77]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[78]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[79]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[7]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[80]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[81]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[82]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[83]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[84]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[85]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[86]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[87]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[88]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[89]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[8]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[90]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[91]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[92]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[93]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[94]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[95]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[96]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[97]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[98]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[99]}]
set_output_delay 2.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {q[9]}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
