read_verilog -sv src/top_area.sv
hierarchy -top TopModule
proc; opt; techmap; opt
stat
write_verilog -noattr build/yosys/top_area_gate_generic.v
