OpenROAD 26Q1-1788-gdc4da4fafa 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 10 thread(s).
read_liberty /Users/huang/Desktop/verilogcoder-goal-benchmark-copy/orfs_workspace/OpenROAD-flow-scripts/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib
read_db ./results/nangate45/prob240_area/base/2_3_floorplan_tapcell.odb
source /Users/huang/Desktop/verilogcoder-goal-benchmark-copy/orfs_workspace/OpenROAD-flow-scripts/flow/platforms/nangate45/setRC.tcl
[INFO PDN-0001] Inserting grid: grid
write_db ./results/nangate45/prob240_area/base/2_4_floorplan_pdn.odb
Elapsed time: 0:00.58[h:]min:sec. CPU time: user 0.56 sys 0.01 (98%). Peak memory: 131460KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
2_4_floorplan_pdn                  0            128 4b73ba49fa0459da4a06
