OpenROAD 26Q1-1788-gdc4da4fafa 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 10 thread(s).
read_liberty /Users/huang/Desktop/verilogcoder-goal-benchmark-copy/orfs_workspace/OpenROAD-flow-scripts/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib
read_db ./results/nangate45/prob240_baseline/base/5_2_route.odb
source /Users/huang/Desktop/verilogcoder-goal-benchmark-copy/orfs_workspace/OpenROAD-flow-scripts/flow/platforms/nangate45/setRC.tcl
filler_placement "FILLCELL_X1 FILLCELL_X2 FILLCELL_X4 FILLCELL_X8 FILLCELL_X16 FILLCELL_X32"
[INFO DPL-0001] Placed 895 filler instances.
write_db ./results/nangate45/prob240_baseline/base/5_3_fillcell.odb
Elapsed time: 0:00.57[h:]min:sec. CPU time: user 0.54 sys 0.02 (97%). Peak memory: 129728KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
5_3_fillcell                       0            126 81462ee3a3b76148a867
