read_verilog -sv src/ref_original.sv
hierarchy -top RefModule
proc; opt; techmap; opt
abc -liberty $::env(SKY130_LIB)
stat -liberty $::env(SKY130_LIB)
write_verilog build/yosys/ref_gate.v
