read_verilog -sv src/top_area.sv
hierarchy -top TopModule
proc; opt; techmap; opt
abc -liberty $::env(SKY130_LIB)
stat -liberty $::env(SKY130_LIB)
write_verilog build/yosys/top_area_gate.v
