OpenROAD 26Q1-1788-gdc4da4fafa 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 10 thread(s).
read_liberty /OpenROAD-flow-scripts/flow/platforms/nangate45/lib/NangateOpenCellLibrary_typical.lib
read_db ./results/nangate45/prob155_area_top/base/3_1_place_gp_skip_io.odb
source /OpenROAD-flow-scripts/flow/platforms/nangate45/setRC.tcl
place_pins -hor_layers metal5 -ver_layers metal6
Found 0 macro blocks.
Using 2 tracks default min distance between IO pins.
[INFO PPL-0001] Number of available slots 556
[INFO PPL-0002] Number of I/O             10
[INFO PPL-0003] Number of I/O w/sink      10
[INFO PPL-0004] Number of I/O w/o sink    0
[INFO PPL-0005] Slots per section         200
[INFO PPL-0008] Successfully assigned pins to sections.
[INFO PPL-0012] I/O nets HPWL: 387.58 um.
write_db ./results/nangate45/prob155_area_top/base/3_2_place_iop.odb
Elapsed time: 0:00.54[h:]min:sec. CPU time: user 0.52 sys 0.01 (97%). Peak memory: 129128KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
3_2_place_iop                      0            126 9091ec844339b139fdcc
