read_verilog -sv ref_original.sv
hierarchy -top RefModule
proc; opt
techmap; opt
abc -g AND,OR,XOR,MUX
stat
